{
  "_num_labels": 29,
  "architectures": ["ElectraForTokenClassification"],
  "attention_probs_dropout_prob": 0.1,
  "bad_words_ids": null,
  "bos_token_id": null,
  "decoder_start_token_id": null,
  "do_sample": false,
  "early_stopping": false,
  "embedding_size": 128,
  "eos_token_id": null,
  "finetuning_task": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 256,
  "id2label": {
    "0": "O",
    "1": "PER-B",
    "2": "PER-I",
    "3": "FLD-B",
    "4": "FLD-I",
    "5": "AFW-B",
    "6": "AFW-I",
    "7": "ORG-B",
    "8": "ORG-I",
    "9": "LOC-B",
    "10": "LOC-I",
    "11": "CVL-B",
    "12": "CVL-I",
    "13": "DAT-B",
    "14": "DAT-I",
    "15": "TIM-B",
    "16": "TIM-I",
    "17": "NUM-B",
    "18": "NUM-I",
    "19": "EVT-B",
    "20": "EVT-I",
    "21": "ANM-B",
    "22": "ANM-I",
    "23": "PLT-B",
    "24": "PLT-I",
    "25": "MAT-B",
    "26": "MAT-I",
    "27": "TRM-B",
    "28": "TRM-I"
  },
  "initializer_range": 0.02,
  "intermediate_size": 1024,
  "is_decoder": false,
  "is_encoder_decoder": false,
  "label2id": {
    "O": 0,
    "PER-B": 1,
    "PER-I": 2,
    "FLD-B": 3,
    "FLD-I": 4,
    "AFW-B": 5,
    "AFW-I": 6,
    "ORG-B": 7,
    "ORG-I": 8,
    "LOC-B": 9,
    "LOC-I": 10,
    "CVL-B": 11,
    "CVL-I": 12,
    "DAT-B": 13,
    "DAT-I": 14,
    "TIM-B": 15,
    "TIM-I": 16,
    "NUM-B": 17,
    "NUM-I": 18,
    "EVT-B": 19,
    "EVT-I": 20,
    "ANM-B": 21,
    "ANM-I": 22,
    "PLT-B": 23,
    "PLT-I": 24,
    "MAT-B": 25,
    "MAT-I": 26,
    "TRM-B": 27,
    "TRM-I": 28
  },
  "layer_norm_eps": 1e-12,
  "length_penalty": 1.0,
  "max_length": 20,
  "max_position_embeddings": 512,
  "min_length": 0,
  "model_type": "electra",
  "no_repeat_ngram_size": 0,
  "num_attention_heads": 4,
  "num_beams": 1,
  "num_hidden_layers": 12,
  "num_return_sequences": 1,
  "output_attentions": false,
  "output_hidden_states": false,
  "output_past": true,
  "pad_token_id": 0,
  "prefix": null,
  "pruned_heads": {},
  "repetition_penalty": 1.0,
  "task_specific_params": null,
  "temperature": 1.0,
  "top_k": 50,
  "top_p": 1.0,
  "torchscript": false,
  "type_vocab_size": 2,
  "use_bfloat16": false,
  "vocab_size": 32200
}
